let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^ايزن بحبك|ايزن عاوزه اتجوزك|بحبك|بموت فيك|نتجوز|ايزن هنتجوز امتي|ايزن انت ليا|ايزن بموت فيك$/i.test(m.text)) { 
     responses = [ 
       'هه توقعت ذلك*   ',  
       '*جعلك تقع في حبي هو جزء من خطتي*',  
             '*فل تراجع نفسك*',  
                   '* ماذا تظنني سأقول*',  
                         ' هل تعتقد اني ميكو',  
                               '* *  متأكد ',  
                                     '*جيد* '  
     ]; 
} else if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text)) { 
     responses = [ 
       'وعليكم السلام',  
          'وعليكم السلام منور',  
              ' وعليكم السلام كيفك',  
                   'وعليكم السلام ورحمة الله وبركاته' 
     ]; 
   }else if (/^ ايزن عامل ايه|كيفكم |عاملين ايه|الدنيا عامله ايه|عاملين ايه يشبب$/i.test(m.text)) { 
     responses = [ 
       '*كل شيء بخير الحمد لله* ',  
          ' *لماذا تسأل*  ',  
              ' * توقعت سؤالك هذا* ',  
                  '*الحمد الله*',  
                      ' *لو انت كويس انا مش كويس*' 
   ];
 }else if (/^تم تعريب هذا الامر|تم الانتهاء|تمت اضافه|تمت اضافة|تم التعريب|هذا الامر انتهي$/i.test(m.text)) { 
     responses = [ 
       ' عاشت ايدك ✨💜',  
           'تسلم ايدك ✨💜 ',  
                'عاش ✨💜 ',  
                  'عاش ايزن ✨💜',  
                   'اوكي ✨💜' 
     ]; 
   }else if (/^لول|هههه|ههههه|هههههه|ههههههه|هههههههه|😂😂😂$/i.test(m.text)) { 
     responses = [ 
       '*جعلك تضحك هو جزء من خطتي* ',  
            ' *ضحكتك الأخيرة*',  
                   '*توقعت ذلك*  ',  
                         'لماذا تضحك؟ ',  
                         'قه قه قه',  
                         '*إيزن الذي سوف يضحك*',  
                         'اضحك معاك؟',  
                             'ضحكة جيدة ' 
   ]; 
   }else if (/^ايزن| عمك|يا ايزن$/i.test(m.text)) { 
     responses = [ 
       '*توقعت مناداتي*',  
          ' *ماذا تريد* ',  
              ' * أرى أنك تحتاجني🧐*',  
                  '*بان كاي* ',  
                   ' *قل ماعندك*' 

]; 
   }else if (/^بوت|يا بوت|البوت|بوووت|بووووت|بوووووت|بووووووووت $/i.test(m.text)) { 
     responses = [ 
       '*توقعت كل شيء إلا غبائك*',  
          ' *أنا ايزن يا ضعيف*',  
              ' *اسمي ايزن ألا تفهم*',  
                  '*ناديني ايزن يا هذا* ',  
                   ' *ايزن تذكر هذا جيدا*' 
  ]; 
   }else if (/^صباح النور|صباح النعناع الاخضر|صباح الفل|صباح|صباح الخير $/i.test(m.text)) { 
     responses = [ 
       '*توقعت قولك هذا*',  
          '*إستيقاظ متأخر* ',  
              ' *صباحك بان كاي*',  
                  '*صباح التوقعات* ',  
                   '*صباحك أبيض*' 
     ]; 
   }else if (/^شكرا|تسلم|تسلمي$/i.test(m.text)) { 
     responses = [ 
       '*جعلك تشكرني هو جزء من خطتي*',  
          ' *توقعت شكرك هذا😎* ',  
              ' *لا تتوقع مساعدتك مجددا*',  
                   '*اهلا بك*' 
]; 
   }else if (/^🧡|💚|💞|💖|💜|💛|🤍 $/i.test(m.text)) { 
     responses = [ 
       'هذا القلب لي شكرا',  
          'توقعت ذلك',  
              'أرسالك لهذا القلب جزء من خطتي',  
                  'رائع',  
                   'ماهذا😑' 
  ]; 
     }else if (/^كل ده نور|الجروب نور كده ليه|ايه منوره|منورين الجدد|منورين|منور $/i.test(m.text)) { 
     responses = [ 
       '*توقعت ذلك*',  
          '*أنه نوري بل طبع*✨',  
              '*لا أرى النور*',  
                  '*مجيئه هو جزء من خطتي*',  
                   '*منور بنوري*' 
  ]; 
   }else if (/^اسكت|اسكت|كلبب|يا ابني اسكت$/i.test(m.text)) { 
     responses = [ 
             'جعلك تغضب هو جزء من خطتي ', 
                 '*متأكد من ذلك',  
                 ' فل تصمت أنت',  
                 'أحمق',  
                   '*لقد اضحكتني*' 
     ]; 
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;
