let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^سوكونا بحبك|سوكونا عاوزه اتجوزك|بحبك|احبك|نتجوز|سوكونا هنتجوز امتي|سوكونا انت ليا|سوكونا بموت فيك$/i.test(m.text)) { 
     responses = [ 
       'ومن تظن نفسك*   ',  
       '*وهل ستعطيني روحك بل مقابل؟*',  
             '*وهل تقارن نفسك بي*',  
                   '* لقد تجاوزت حدك ايها الاحمق*',  
                         ' هل تعتقد اني ميكو',  
                               '* *  همم جيد ',  
                                     '*جيد* '  
     ]; 
} else if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text)) { 
     responses = [ 
       'وعليكم السلام',  
          'وعليكم السلام منور',  
              ' وعليكم السلام كيفك',  
                   'وعليكم السلام ورحمة الله وبركاته' 
     ]; 
   }else if (/^ سوكونا عامل ايه|كيفكم |عاملين ايه|الدنيا عامله ايه|عاملين ايه يشبب$/i.test(m.text)) { 
     responses = [ 
       '*كل شيء بخير الحمد لله* ',  
          ' *لماذا تسأل*  ',  
              '  وهل تظن انني سأرد عليك ',  
                  '*الحمد الله*',  
                      ' *لو انت كويس انا مش كويس*' 
   ];
 }else if (/^تم تعريب هذا الامر|تم الانتهاء|تمت اضافه|تمت اضافة|تم التعريب|هذا الامر انتهي$/i.test(m.text)) { 
     responses = [ 
       ' عاشت ايدك ✨💜',  
           'تسلم ايدك ✨💜 ',  
                'عاش ✨💜 ',  
                  'عاش سوكونا ✨💜',  
                   'اوكي ✨💜' 
     ]; 
   }else if (/^لول|هههه|ههههه|هههههه|ههههههه|هههههههه|😂😂😂$/i.test(m.text)) { 
     responses = [ 
       '*ضحكه سخيفه* ',  
            ' *ضحكه قبل الموت*',  
                   '*يالك من رقيق*  ',  
                         'لماذا تضحك؟ ',  
                         'قه قه قه',  
                         'وجهك الغبي هو المضحك صحيح؟',  
                         'وهل هناك شيئ مضحك؟',  
                             'ضحكة جيدة ' 
   ]; 
   }else if (/^سوكونا| عمك|يا سوكونا$/i.test(m.text)) { 
     responses = [ 
       '*هل تحتاجني يا هذا*',  
          ' *الزم حدودك للحفاظ علي حياتك* ',  
              ' * غامبري غامبري*',  
                  '*هل تتجرأ وتناديني* ',  
                   ' *هل لديك شيئ مهم*' 

]; 
   }else if (/^بوت|يا بوت|البوت|بوووت|بووووت|بوووووت|بووووووووت $/i.test(m.text)) { 
     responses = [ 
       '*ناديني بأسمي ايها السفيه*',  
          ' *سوكونا تذكره لانه اخر شيئ تسمعه*',  
              ' *اسمي سوكونا ألا تفهم*',  
                  '*انا لست ايزن لن اتساهل معك* ',  
                   ' *أحمق ناديني بأسمي*' 
  ]; 
   }else if (/^صباح النور|صباح النعناع الاخضر|صباح الفل|صباح|صباح الخير $/i.test(m.text)) { 
     responses = [ 
       '*صباح الشر*',  
          '*إستيقاظ متأخر* ',  
              ' *صباحك رائع مثلي*',  
                  '*صباح الدراسه* ',  
                   '*صباحك أسود*' 
     ]; 
   }else if (/^شكرا|تسلم|تسلمي$/i.test(m.text)) { 
     responses = [ 
       '*لا داعي للشكر*',  
          ' *أن شكرك لا يساوي. شئ عندي* ',  
              ' *لا تتوقع أن اساعدك*',  
                   '*لست بحاجه لان تشكرني*' 
]; 
   }else if (/^🧡|💚|💞|💖|💜|💛|🤍 $/i.test(m.text)) { 
     responses = [ 
       'هذا القلب لي شكرا',  
          'إن قلبك هذا سيصبح اسود',  
              'خذ قلبي انا لا احتاجه ♥️',  
                  'لا شكرا استطيع العيش بدون قلب',  
                   'امسك هذا انا لا احتاجه ♥️' 
  ]; 
     }else if (/^كل ده نور|الجروب نور كده ليه|ايه منوره|منورين الجدد|منورين|منور $/i.test(m.text)) { 
     responses = [ 
       '*نورهم مثل نور نيران تشتعل*',  
          '*انا منور غظب عنكو*✨',  
              '*لا أرى النور*',  
                  '*بوجودي طبعا*',  
                   '*منور بنوري*' 
  ]; 
   }else if (/^اسكت|اسكت|دز|يا ابني اسكت$/i.test(m.text)) { 
     responses = [ 
             'الزم حدودك وإلا مزقتك اربن ', 
                 '*متأكد من ذلك',  
                 ' يبدو انك تتمني الموت',  
                 'أحمق',  
                   '*هل يجب أن اخاف؟*' 
     ]; 
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;